print("===== โปรแกรมคำนวณพื้นที่ =====")
print("1. สี่เหลี่ยมผืนผ้า")
print("2. สามเหลี่ยม")
print("3. สี่เหลี่ยมจัตุรัส")

เลือก = int(input("เลือกเมนู 1-3: "))

if เลือก == 1:
    กว้าง = float(input("กรอกความกว้าง: "))
    ยาว = float(input("กรอกความยาว: "))
    พื้นที่ = กว้าง * ยาว
    print("พื้นที่สี่เหลี่ยมผืนผ้า =", พื้นที่)

elif เลือก == 2:
    ฐาน = float(input("กรอกฐาน: "))
    สูง = float(input("กรอกความสูง: "))
    พื้นที่ = 0.5 * ฐาน * สูง
    print("พื้นที่สามเหลี่ยม =", พื้นที่)

elif เลือก == 3:
    ด้าน = float(input("กรอกความยาวด้าน: "))
    พื้นที่ = ด้าน * ด้าน
    print("พื้นที่สี่เหลี่ยมจัตุรัส =", พื้นที่)

else:
    print("กรุณาเลือกเมนู 1-3")